{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"trainable": true, "dtype": "float32", "batch_input_shape": [null, 777, 39], "stddev": 0.3, "name": "gaussian_noise_52"}, "class_name": "GaussianNoise"}, {"config": {"padding": "causal", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1], "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1], "filters": 200, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [4], "trainable": true, "name": "conv1d_248", "activation": "selu", "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "rate": 0.3, "name": "dropout_272"}, "class_name": "Dropout"}, {"config": {"padding": "causal", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1], "use_bias": true, "kernel_regularizer": null, "dilation_rate": [2], "filters": 150, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [4], "trainable": true, "name": "conv1d_249", "activation": "selu", "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "rate": 0.3, "name": "dropout_273"}, "class_name": "Dropout"}, {"config": {"padding": "causal", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1], "use_bias": true, "kernel_regularizer": null, "dilation_rate": [4], "filters": 120, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3], "trainable": true, "name": "conv1d_250", "activation": "selu", "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_80", "strides": [3], "pool_size": [3]}, "class_name": "MaxPooling1D"}, {"config": {"padding": "causal", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1], "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1], "filters": 80, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [2], "trainable": true, "name": "conv1d_251", "activation": "selu", "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_274"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "bidirectional_54", "layer": {"config": {"unroll": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.2, "implementation": 2, "activity_regularizer": null, "dropout": 0.3, "stateful": false, "trainable": true, "activation": "tanh", "go_backwards": false, "use_bias": true, "return_sequences": true, "name": "gru_5", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 200, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "bias_regularizer": null}, "class_name": "GRU"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_55", "layer": {"config": {"unroll": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.2, "implementation": 2, "activity_regularizer": null, "dropout": 0.3, "stateful": false, "trainable": true, "activation": "tanh", "go_backwards": false, "use_bias": true, "return_sequences": true, "name": "gru_6", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 200, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "bias_regularizer": null}, "class_name": "GRU"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "name": "dense_105", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "units": 150, "activation": "selu", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"size": 3, "name": "up_sampling1d_62", "trainable": true}, "class_name": "UpSampling1D"}, {"config": {"trainable": true, "rate": 0.3, "name": "dropout_275"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "name": "dense_106", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "units": 100, "activation": "selu", "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.3, "name": "dropout_276"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_regularizer": null, "name": "dense_107", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "units": 40, "activation": "softmax", "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}